{
  "course": "DSM100-2022-OCT",
  "topic": "Module information",
  "title": "Module introduction video",
  "url": "https://learn.london.ac.uk/mod/page/view.php?id=96059&forceview=1",
  "transcript": "-Welcome to AI Module.Artificial intelligence made enormous progress in recent years,entering all spheres of economy, technology, and our everyday life.AI is a driving force behind the growth of such top companies as Amazon, Facebook, Apple, Microsoft. AI is behind our daily activities,be it searching on Google, checking directions on Google Maps,talking to Siri, receiving targeted recommendations and advertisement,or going through security checks.AI has a more than seven decades history, with its ups and downs,but few doubt now that AI here is to stay.The term AI covers a wide range of techniques, approaches, methods. For some, AI is almost the same as machine learning,and for some, AI, it's almost the same as all of computing and robotics.In this module,we will be focusing on such foundational AI techniques as reasoning,decision making, knowledge representation, and robotics.Our program includes other AI-related modules,machine learning, natural language processing,neural networks.In this module, we intentionally will not be covering these topics.We will adopt an intelligent agent approach.We will follow in this to what is known by many as the best AI textbook,written by Peter Norvig and Stuart Russell.This module will include four theoretical topicsand six topics of more practical nature. We will focus on concrete AI systems and case studies.You will have an opportunity to learnhow they're built and how they're working.After the end of this module,you should be able to critically evaluate key issues in agent-based system,knowledge system, robotics, automated reasoning,and problem-solving,represent tasks, environments, and outline strategies for intelligent agents,compare the adequacy and efficiency of different reasoning approaches.We form a deep researched analysis of a particular artificial intelligence methodand their use,apply AI techniques within the context of a substantial research project.I wish you very best of luck with this module."
}