{
  "course": "DSM100-2022-OCT",
  "topic": "Topic 3: Knowledge, reasoning and planning",
  "title": "Lecture 6: Logical reasoning",
  "url": "https://learn.london.ac.uk/mod/page/view.php?id=96179&forceview=1",
  "transcript": "[music]In this mini-lecture, we will consider different types of logical reasoning, deduction, abduction, and induction.Deduction, if we have a rule and a fact, then we can deduce a fact. The conclusion is guaranteed to be correct. Abduction, if we have a rule and a fact,then we can abduce a fact.In this case, the conclusion is not necessarily correct.It is only a plausible explanation. We need an extra step to come from or reject the truthfulness of the conclusion.In this example on the slide,we may need to catch Daffy and check if he's a swan or a duck.Why is it so different while the rule-fact notations look similar?We can look at deduction and abduction reasoninga little bit closer.Deduction [?] dates back to antiquity. It is one of the standard patterns of inference then can be plot to derive chains of conclusionsthat lead to the desired goal. The pattern is if P, then Q. This is a condition. P, assertion.Therefore, Q, a conclusion. Abductive reasoning was formulated as a form of logical inferenceby American philosopher, Charles Sanders Peircein the beginning of the 19th Century. The pattern is if P, then Q, a condition.Q, observation. Therefore, P, possible explanation.People often do not understand this difference.For example, the famous deductive mindset of Sherlock Holmesis actually not deductive.Sherlock Holmes used abductive reasoning, looking for plausible explanations.In this topic so far, we saw examples of deductive reasoning.Subsumption, inference about class-subclass structure. Classification, inference about to what class an object belongs to,based on the definition of the object and classes. Prolog reasoning is also deductive,to identify the truthfulness of logical statements or goals.We will have a chance to discuss the usage and implementation of abductive reasoningin a different topic where we will consider the Robot Scientist AI System.Induction is generalization of facts. Like abduction and unlike deduction, it is not guaranteed to be correct. A verification step is required to establish the truth.Machine learning essentially is based on inductive reasoning.Many facts are processed and general conclusions,for example, predictions are made.Induction reflects our common sense.We observe that the sun rises every dayand it is reasonable to assume it will rise every day.I do hope this generalization is correct.In this mini-lecture,we inspected different types of logical inference,deductive, abductive, and inductive reasoning. There are of course other types of reasoning, for example, qualitative reasoning, case-based reasoning,[?] reasoning, and probabilistic reasoning.All these forms of reasoningcan be employed for intelligent agents to make decisions and to search for solutions."
}