{
  "course": "DSM100-2022-OCT",
  "topic": "Topics 5&6: Creatures",
  "title": "Lecture: Lesson 5 Introduction",
  "url": "https://learn.london.ac.uk/mod/page/view.php?id=96341&forceview=1",
  "transcript": "[music]Okay. You came back for Week 5. Well done.If you really want to know about the state of the art, you're in the right place.We're going to be covering a few different papers this week where we find out about what researchers have done, if you like, since 1994, and certainly, the last few years to add to this ability of genetic algorithms to involve different types of morphologies.What are we going to learn about?Well, first of all, at the end of this week, we're going to be able to select and explain examples of the state of the art in evolutionary computing.We're not just looking at evolving weird and wonderful creatures using genetic algorithms, but you're also going to see some other papers where people are evolving things like neural networks to solve image classification problems and more traditional types of AI, machine learning type problems like that.Then we're going to have a brief discussion of the challenges in the field of evolutionary computing.What are people trying to do in the most recent papers?What are the problems they're hitting against?We'll learn that from looking at some of the papers and having a good read.You're going to have to do some reading of papers.I'm going to guide you through a few of the papers, but I'm also going to give you links, so you can go and read the details.Like I said before, now we've actually built this thing ourselves from scratch.We've got a really strong insight into what to expect from these papers.Hopefully, having built that genetic algorithm, when you look at a genetic algorithm paper, you're now looking for those things, you're saying, \"What's the encoding scheme?What's the population model? What are you using?Tournament or roulette wheel, how does it work?\" Because you know what those things are now.Well done for reaching Week 5.We're going to have some interesting looks at some of the state of the art work this week."
}