{
  "course": "DSM100-2022-OCT",
  "topic": "Topic 7: Robot Scientist",
  "title": "Lecture 2: The concept of Robot Scientist",
  "url": "https://learn.london.ac.uk/mod/page/view.php?id=96363&forceview=1",
  "transcript": "[music]In this mini-lecture, we will introduce the concept of a robot scientist,an AI system for scientific discovery. We will discuss why such systems are required,what was the motivation for the development,the advantages, and disadvantages.We will consider the architecture and basic componentsof a robot scientist system.What is a robot scientist? The concept has been introduced in 2004 by Professor Ross King,currently working at Chalmers University of Technology in Sweden.He and his colleagues have demonstrated that it is possible to automate the scientific process.They reported on the successful developmentof a system capable of carrying out cycles of scientific experimentation.The system was named Adam, a discovery machine.It is when I joined the Robot Scientist Project and I continued to be involved in it ever since.Robot scientist is an AI systemcapable of originating its own experiments,physically executing them, interpreting the results,and then repeating the cycle.The system relies on a knowledge base that encodes knowledge and dataabout a particular domain.Robot scientists can infer from its knowledge base scientific hypothesis,something new, what is not already encoded in the knowledge base.These hypotheses are not necessarily true.There are possible explanations of the available data and phenomenato establish if the inferred explanations are correct.The system designs experiments to test those hypotheses.Robot scientist is a physically implemented systemthat includes robotic equipment for testing generated hypotheses. It can carry out many experiments in paralleland then analyze the results. The analysis component makes a decision if the hypotheses were confirmed or not.It then updates its knowledge basewith new experimental data and conclusions. Then, the cycle can be repeated.New hypotheses formulated and updated knowledge basecan be used to generate new experimentsand execute them, results are analyzed, and so on,thousands of times if necessary.The concept of a robot scientist is a technological implementation of the hypothetical deductive method of scientific discovery.According to Encyclopedia Britannica,it is a procedure for the construction of a scientific theorythat will account for results obtained through direct observation and experimentation,and that will, through inference, predict further effectsthat can then be verified or disapproved by empirical evidencederived from other experiments.Not all sciences include experimentation, but many do.Computer science involves computational experiments.Social sciences involve surveys and observational studies. Of course, not all experiments can be automated.The research field of scientific discovery is still in its infancy,but it has an immense potentialfor speeding up the technological progress,and ultimately, improving the quality of our lives.Why do we need robot scientists? Don't we have enough of scientists already? Firstly, it is important for our understandingof what science is. As Richard Feynman, a Nobel Prize winner famously wrote,\"What I cannot create, I do not understand.\"If we can create a machine that is doing science,only then we can truly understand what science is.Secondly, it is necessary for the technological advance.The production of data significantly outperforms the production of knowledge.We do not have enough resources to analyze all the data we are producingto decipher useful knowledgefrom the vast amount of data we're producing every minute.Robot scientists have the potential to increase the productivity of science. They can work cheaper, faster, more accurately, and longer than humans.One of the positive aspects of robot scientistsis that they can record and share all steps of scientific discovery.Humans are reluctant to do so, and it requires time and effort.Making science openis important from ethical and legal perspectives,and we do not have enough scientists to tackle the challenges of the modern world. It takes several years to educate a new scientist.Robot scientists can be easily multiplied.A robot scientist can be built in a couple of months.They're still expensive because they're not mass-produced.The estimate is that it should cost as an ordinary car.Human scientists no longer can read all the scientific articles,check all the results, and keep in mind all the information about complex systems.They're good in deep understanding of phenomena,making conclusions from small data, leaps of imagination,but they need help in processing big dataand making unbiased, accurate, logical inferences.In this mini-lecture,we discussed the concept of a robot scientist, why we need them, and what they're capable of.Robot scientists offer a great technological advancebut their application is limited to certain scientific areasamenable to automation."
}