{
  "course": "DSM100-2022-OCT",
  "topic": "Topics 9&10: Game Player",
  "title": "Lecture: Week intro",
  "url": "https://learn.london.ac.uk/mod/page/view.php?id=96429&forceview=1",
  "transcript": "[music]Welcome to week four. It's finally time to build and train this AI game-playing system.Let's just look at the learning objectives, and then we'll get some previewsof what we're going to be seeing this week. First of all, at the end of this week, you should be able to explainhow the DQN agent architecture and learning systemis expressed as a working program. Secondly, you should be able to evaluate the performance of the DQN agent.You need to be able to know how you can test whether this thing is actually working or not.Finally, I'm going to show you how to deploy a pre-trained neural networkand use it to play games in real-time. That's important, because you may not have the facilities to train this thing,but I do and I've trained this thing for you.I'm going to show you that once someone's trained the network for you,it's easy to implement that and deploy that in your code. Okay, so what about the previews? Well, first of all, the big thing we're going to be doing this weekis we're going to be looking at code.But, really importantly, it's really vital that you make the connectionbetween the sort of maths equations that are in the paperand the actual implementation in code.I'm going to very carefully make the connection between this complicated \"loss\" functionand exactly how that's implemented in the code, which line relates to which, so you can see that the code really directly implementsexactly what's in that equation. Then secondly, what we're going to see is the AI playing a video game.You can see herea reasonably well-trained AI playing Break Wall,which is our version of Breakout.Yes, it's not doing too badly. It's scoring a few points.Okay, so that's what we're going to be looking at, and eventually you will have this running on your systemat the end of this week.Okay, great. Welcome to week four.I'm looking forward to seeing how you get on with the actual implementation and see if anyone can train a better model than I can to play Break Wall.I hope you enjoy seeing the full implementation of the DQN agent."
}