{
  "course": "DSM100-2022-OCT",
  "topic": "Topics 9&10: Game Player",
  "title": "Lecture: Ethics of game playing AI",
  "url": "https://learn.london.ac.uk/mod/page/view.php?id=96496&forceview=1",
  "transcript": "[music]In this video, we're going to consider a couple of aspects of the ethicsof gameplaying AI.In summary, we're going to first think about fairness.How fair are the competitions that we have createdwhere humans play AI's at games?Secondly, we're going to think about the impact on playersof having these superhuman AI's that play games.What about fairness?Here is an extreme view of fairness.We're going to look at the middle quote there.Just that one there, \"A completely fair competitioncan only be achieved against an artificial systemthat is essentially equivalent to a flesh and blood human.\"What they're saying is that if you want a completely fair competition,you need to have a flesh and blood human playinga flesh and blood human, otherwise, it's not going to be fair.That's not that helpful, though.Frankly, it doesn't really tell us how we can make the competition more fair.Luckily, they came up with six dimensions of fairness in this paper,where we can consider how fair is our competition that we've set up.Let's go through each of these in turn.I'm just going to list them off first.We've got perceptual, motoric, historic, knowledge, compute,and common sense.What do they all mean? First of all, perceptual.Do the two competitors use the same input space?What is the input space?If you think about the DQN agent, the input spaceis really the state of the gamethat we can see.You can see clearly by allowing the AI to only see screenshotsof what's going on in the game, as opposed to having detailed informationabout where all the pieces are, it just has the raw pixel screenshots.That's trying to address that dimension.Is trying to make it as perceptually fair as it can.Obviously, the extreme view would be well, actually, a human being,the light has to come into their eye, and then it has to be processed,and all this kind of stuff happens.It's a little bit unfair, whereas the AI just gets the raw datafrom the pixels directly.That's what they mean probably by saying there has to bea flesh and blood human. Nevertheless, these are continuums.You can move along from really unfair to more fair.I would say that, say for Atari video game players,for example, only being able to let the AI see the raw pixel datathat is moving towards fairness.What about motoric?Do the two competitors use the same output space?The output space is literally the action spacein our open AI gyms that we've been using in the Atari games.The action space is one, two, three, or fourin the case of Breakout.You can go left, right, or do nothing or move up, I think is the other onethat doesn't do anything.You got four options, that's your output space.The question is, is the AI been given any extra things that it can dothat the human can't do?You got to wonder how quickly a human is able to actually generatethose outputs.How quickly can a human being go left or right?There's an accelerated decision-making process going on there,and then the ability to enact those decisions is instant.The AI can go left.As soon as it decides to go left,it goes left in the next frame, doesn't it?Whereas the human might be thinking about what they had for dinner,or whatever before they go left.That's one element, but certainly, only allowing the AI to generatethe control inputs for the game, and not having any deeper accessto the game is again, moving along towards fairness.What about historic?Did the two systems spend the same amount of time on training?What we're talking about here is it, for example, the Atari game,it trained played for thousands and thousands and thousands of games.When I'm trying to play against it, if I played,if I'd been given the chance to play for thousands and thousands of games,or, and then even worse with things like Dota 2 and the OpenAI Five,I don't know how long that played for, but it probably--If, for example, it's playing for thousands or hundreds of years,because it can run the simulation really fast on a whole rackof computing hardware, it might be playingfor hundreds of years even. I don't know what the difference is.If the AI is able to play for years and years and yearsof actual real-time playing equivalent, whereas the human beingcan only play since the game became available to them.They've only had a limited time window and only they got to do other thingslike maybe going to school or whatever they do.That's clearly unfair.The historic aspect I would say they're not doing that well on that yet.To make it fair, you'd have to say, \"Well, we're going to create a new game,and the human gets to play it for 10 hours,and the AI gets to play it for 10 hours.It has to train on that limited time.\"Then that's how you would make that fair.What about knowledge?Do the two systems have the same access to declarative knowledge about the game?What we're talking about here, as I understand it, is whether the AIhas some special knowledge about what's going on in the game.If you think about the Breakout example, are you telling the AIexactly the XY positions of all the bricks,so as you've got this special data coming through, or you're just giving itthe raw pixel data?I would say this relates to perceptual a little bit.Are you just giving it a shared perceptual spaceand it has to figure out what's going on by just looking at the game?Or are you giving it special data about where other people are?Another thing to say about the perceptual knowledge spacethat's mentioned in terms of these StarCraft and Dota,is, as I understand it when you're playing those gamesas a human, you can only see a limited window on the game.On the game map, you only see a little bit of the game.The game map might be like that.You can only ever see that much, and you have to move aroundto see more of it.Whereas the AI in some of those games, I think they give it the whole map.It can instantaneously access any bit of the map,whereas a human would have to move to the bit they want to.That's interesting, isn't it? What about compute?Do the two systems have the same computational power?The question is, do I have the same computation power as this?I don't know. Absolutely no idea how you'd measure that.I'm sure there are papers you can find where people do attempt to do that,but that's clearly a challenge.I would say that probably having a massive room full of graphics cards,and then versus one human is maybe not fair, but I don't know.Then what about common sense?Do the agents have the same knowledge about other things?This is coming back to the more of a paradox thing.It's the idea that AI's might be able to get incredibly goodat playing StarCraft, but they can't make a cup of tea,or they can't take the dog for a walk or whatever.That's the thing.When we mean by common sense, have you addressed the challengesof general AI in your agent?I would say, again, it's a continuum from not at all to quite well,and things like Agent57, the most recent DeepMind Atari game-playing agent,it's a general AI and even the DQN is a general AIin terms of is general across Atari game. It doesn't just play one.It is able to learn to play multiple games with the same architectureor the same hyperparameters.That's the idea is are the people working towards general AIor are they just building a highly specific systemjust to play this one game?Here's a more moderate view of fair.Now we've considered all of that, here's a more moderate view of fairness.Remember, our extreme view is that basically, it's only fairif you've got two human beings playing each other.The moderate view is \"Through the discussion of two areas,the perceptual and motoric abilities, and the game's extrinsicand intrinsic factors, we have to show that, so far,no fair competition between AIs and humans has occurred.\"It's slightly more moderate.This is in the when are we done with games paper.They conclude that they were not done with games, which is goodbecause games are fun.I now want to move on to another area of ethics relating to video games,which is the impact of superhuman AI players on game players.First of all, let's look at this first quote here.\"The lessons that AlphaGo is teaching us are going to influence how go is playedfor the next 1000 years.\"That is a commentator from AlphaGo the movie.I recommend you watch AlphaGo the movie, it's on YouTube. It's free.That's clearly a positive message to say, AlphaGo, the way it played Go was unique,and it came up with interesting, creative new ways to play itthat nobody's used before even though the game's really old.Therefore, we're learning from it.It's teaching us new ways to do things, new creative ways to play Go, which is--That's cool. That's good. That's positive.The other quote is from the BBC News, \"The South Korean said he had decidedto retire after realizing: \"I'm not at the topeven if I become the number one.\"Lee Sedol decided to retire after this game with AlphaGobecause he couldn't be number one anymore because he realized that AlphaGowas just going to get better and better.There's no way he's going to be able to beat it.For him, for that amazing, beautiful playerthat everybody across the world in the world of Go just saw as this,the peak of Go, historically amazing playergenerationally amazing and he stopped playing so that is sad.Clearly, that's a negative impact, a very negative impact on someone.He's got to do something else now with his life, so that's interesting.That is like a microcosm of what superhuman AI isand AI's that can do humans jobs cheaper are going to be doingover the next few decades.To conclude, we've just been talking about two aspects of the ethicsof AI game players.We talked about fairness and gave you a load of different dimensionsin which you might measure how fair a given AI human competition is.Then we talked about the impact of superhuman AI game players on humansand human players, and so as a positive view of thatand also a more negative view.In this video, we just been considering ethical aspectsof game-playing AI's."
}